Revit 2027 API
PDFExportOptions.ExportQuality Property
 The preferred export quality (DPI).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PDFExportQualityType ExportQuality { get; set; }
Public Property ExportQuality As PDFExportQualityType
	Get
	Set
public:
property PDFExportQualityType ExportQuality {
	PDFExportQualityType get ();
	void set (PDFExportQualityType value);
}
member ExportQuality : PDFExportQualityType with get, set
Property Value
PDFExportQualityType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This quality setting is the equivalent of printer resolution found in advanced printer settings. An effect of the setting is to control tessellation quality.
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace